<template>
    <div>
        <h2>自己紹介</h2>
        <div class='profileDetail'>
            <div>
                <span>名前: 
                    <ruby>
                        <rb class='myName'>岡本 梓沙</rb>
                        <rp>(</rp>
                        <rt class='furigana'>おかもと あずさ</rt>
                        <rp>)</rp>
                    </ruby>
                </span><br>
                <span>生年月日:
                    1998年2月10日
                </span><br>
                <span>SNS等:<br>
                    <a class='twitterIcon' href='https://twitter.com/azu_proglove' target='_blank' rel='noopener noreferrer'><i class='fab fa-twitter-square fa-3x'></i></a>
                    <a class='facebookIcon' href='https://www.facebook.com/profile.php?id=100006217548803' target='_blank' rel='noopener noreferrer'><i class='fab fa-facebook-square fa-3x'></i></a>
                    <a class='githubIcon' href='https://github.com/azufb' target='_blank' rel='noopener noreferrer'><i class='fab fa-github fa-3x'></i></a>
                    <p>
                        お問い合わせは、<br>
                        TwitterやFacebook<br>
                        でお受け致します!!
                    </p>
                </span>
            </div>
            <div class='keireki'>
                <p class='text1'>
                    兵庫県で生まれ、兵庫県で育ってきました。<br>
                    小学5年生から中学3年生まで英会話教室に通っていたこともあり、英語が好きで、高校も県内の国際科がある高<br>
                    校に進学しました。高校2年生の時に、約1週間ほど滞在したアメリカ・シアトルでの経験から、将来、貿易関係<br>
                    の仕事をしたいと思い、英語の勉強だけでなく、経済やビジネスの知識も必要だろうと考え、大学の学部は商学<br>
                    部を選択。大学では、新入生の正規留学生を一定期間行う活動に参加したり、留学生と交流できる機会を見つけ<br>
                    ては積極的に参加し、英語学習も継続していました。<br>
                    大学2年生の時には、約1ヶ月間の「海外インターンシッププログラム」という、大学で募集していたプログラム<br>
                    に参加。アメリカ・ロサンゼルスの現地の語学学校で、事務・受付のお仕事を経験させて頂きました。<br>
                    大学3年生の、専攻選択では、教授の入れ替わりなどもあり、世界経済・金融の知識を中心に学ぶべく、金融を<br>
                    専攻し、ディベートやプレゼンテーションを通して、経済や金融について学習しました。<br>
                    大学4年生の夏までは、近所のスーパーでアルバイトをしていたのですが、大学最後にアパレルで働いてみたいと<br>
                    考え、派遣会社に登録し、子供服のお店で販売員として働く経験をしました。<br>
                    2020年3月には、大学を卒業。卒業後は、引き続き、子供服のお店で販売員をしていたのですが、コロナウイル<br>
                    ス感染拡大の影響を受けて、派遣期間が短縮されてしまい、退職に至りました。<br>
                    プログラミング学習に関しましては、「1週間1制作計画」を通して、いくつかアプリケーションを作成すること<br>
                    を通して、JavaScriptやReact、Vue.jsなどについて学習してきました。
                </p>

                <p class='text2'>
                    兵庫県で生まれ、兵庫県で育ってきました。<br>
                    小学5年生から中学3年生まで英会話教室に通っていたこともあり、英語が好きで、高校も県内の国際科がある高校に進学しました。高校2年生の時に、約1週間ほど滞在したアメリカ・シアトルでの経験から、将来、貿易関係の仕事をしたいと思い、英語の勉強だけでなく、経済やビジネスの知識も必要だろうと考え、大学の学部は商学部を選択。<br>
                    大学では、新入生の正規留学生を一定期間行う活動に参加したり、留学生と交流できる機会を見つけては積極的に参加し、英語学習も継続していました。<br>
                    大学2年生の時には、約1ヶ月間の「海外インターンシッププログラム」という、大学で募集していたプログラムに参加。アメリカ・ロサンゼルスの現地の語学学校で、事務・受付のお仕事を経験させて頂きました。<br>
                    大学3年生の、専攻選択では、教授の入れ替わりなどもあり、世界経済・金融の知識を中心に学ぶべく、金融を専攻し、ディベートやプレゼンテーションを通して、経済や金融について学習しました。<br>
                    大学4年生の夏までは、近所のスーパーでアルバイトをしていたのですが、大学最後にアパレルで働いてみたいと考え、派遣会社に登録し、子供服のお店で販売員として働く経験
                    をしました。<br>
                    2020年3月には、大学を卒業。卒業後は、引き続き、子供服のお店で販売員をしていたのですが、コロナウイルス感染拡大の影響を受けて、派遣期間が短縮されてしまい、退職に至りました。<br>
                    プログラミング学習に関しましては、「1週間1制作計画」を通して、いくつかアプリケーションを作成することを通して、JavaScriptやReact、Vue.jsなどについて学習してきました。
                </p>
            </div>
        </div>
    </div>
</template>