<template>
    <div id='aisatu'>
        <h2>Welcome To My Portfolio!!</h2>
        <p class='text1'>
            こんにちは、岡本梓沙と申します。<br>
            私のポートフォリオサイトにお訪ねくださり、ありがとうございます。<br>
            私は、エンジニアを目指して独学でプログラミングの勉強をしております。<br>
            こちらのサイトでは、独学の成果として作成したアプリを掲載しております。<br>
            いくつかのアプリにつきましては、リンクを付けており、実際にご利用可能と<br>
            なっております。是非、ご覧ください!!
        </p>

        <p class='text2'>
            こんにちは、岡本梓沙と申します。<br>
            私のポートフォリオサイトにお訪ね下さり、ありがとうございます。<br>
            私は、エンジニアを目指して、独学でプログラミングの勉強をしております。<br>
            こちらのサイトでは、独学の成果として作成したアプリを掲載しております。いくつかのアプリにつきましては、リンクを付けており、実際にご利用可能となっております。是非、ご覧ください!!
        </p>
    </div>
</template>