<template>
    <div>
        <h2>プログラミングとの出会い</h2>
        <p>
            これまで、英語を中心に勉強してきて、ずっと文系で生きてきた私。<br>
            なぜ、プログラミングと出会い、なぜ、エンジニアを目指そうと思ったのかについて、少し振り返ってみる。<br>
            <br>
            大学3年生の冬休みに、就活を始めて、当時、興味があった企業の社員の方とお話しする機会があった。<br>
            その時、「どの職種で就職するとしても、Excel VBAはできるようにしておいた方が良いよ。役に立つよ。」<br>
            と教えて頂いた。正直、興味がある企業ではあったが、まだその業界・職種に絞った訳ではなかったため、こん<br>
            な、どの職種にも使える技術なんだったら身につけておいて損はないなと考え、就職するまでに勉強しようと決<br>
            めた。さらに、丁度卒業までに取らなければならない単位が少し残っており、4年生の春学期に、情報系の科目で<br>
            Excel VBAの授業が開講されることを知り、「単位も取れるし、就職してからも役立つスキルが学べるみたいだし、<br>
            ラッキー!!」と思い、履修を決めた。<br>
            <br>
            4月に入り、待ちに待ったExcel VBAの初回の授業に参加。MsgBox関数を用いて、「こんにちは!」を出力すること<br>
            ができた瞬間、とても感動したことを今でも鮮明に覚えている。自分が記述した言葉が、画面にいきなり現れて、<br>
            驚いたし、自分でコンピュータを好きなように動かせた気になって、快感だった。この経験がプログラミングと<br>
            出会うきっかけになった。<br>
            その時期、複数企業からいわゆる「お祈りメール」を頂いてばかりで、自分の就活に疑問を持った時期だった。<br>
            自分が目指している方向って本当に合っているのか、自分がやりたい仕事は何なのか。再度、自己分析や現状の<br>
            就活状況について振り返ってみた。わかったことは、当時、「その時の自分が持っている知識・得意分野」で<br>
            活躍できる企業・業界はどこなのか」という考えで就活をしていたこと。自分の将来の希望や理想などではなく、<br>
            現状しか見ておらず、適切な業界選びができていなかったと考えた。<br>
            <br>
            Excel VBAの授業を受けていて、コードを書いていることが面白かったし、自分が書いた通りに動くことが嬉しく<br>
            てしょうがなかった。
        </p>
    </div>
</template>