<template>
    <div>
        <h2>プログラミングとの出会い</h2>
        <p>
            大学3年生の冬ごろ、就職活動を始めた頃に、興味のあった企業の方からお話を聞く機会があった。<br>
            その時に、「どんな業種・職種であってもExcel VBAが使えたら損しないよ」という話を伺った。<br>
            そこで、大学の情報系科目の中に、Excel VBAの授業が開講されていると知り、4年生の春学期に履修。<br>
            Excelには馴染みがあったが、開発モードを利用するのは初めてでとても緊張したのを覚えている。<br>
            最初の授業では、メッセージボックスに文字を表示してみるということを学び練習したのだが、MsgBox関数を<br>
            用いて、自分が書いたことが画面上で実現されたことにとても感動した。同時に、大きな達成感を味わった。<br>
            授業自体は、正直に言うと、難しかった。それでも、自分が書いたコードの通りに動作させることができて嬉しかった。<br>
            そこで、私は、プログラミングに興味をもち、もっと自分でコードを書いて動かしてみたいと感じた。<br>
        </p>
    </div>
</template>